dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxHspdm_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_HSPDM_ID_Bits
{
    Ifx_UReg_32Bit MODREV:8;          /**< \brief [7:0] Module Revision Number - MODREV (r) */
    Ifx_UReg_32Bit MODTYPE:8;         /**< \brief [15:8] Module Type - MODTYPE (r) */
    Ifx_UReg_32Bit MODNUMBER:16;      /**< \brief [31:16] Module Number Value - MODNUMBER (r) */
} Ifx_HSPDM_ID_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_HSPDM_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_HSPDM_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_HSPDM_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_HSPDM_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_HSPDM_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_HSPDM_KRSTCLR_Bits;

/** \brief MUTE0 Register */
typedef struct _Ifx_HSPDM_MUTE0_Bits
{
    Ifx_UReg_32Bit START0:13;         /**< \brief [12:0] Start Address 0 - START0 (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit END0:13;           /**< \brief [28:16] End Address 1 - END0 (rw) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_HSPDM_MUTE0_Bits;

/** \brief MUTE1 Register */
typedef struct _Ifx_HSPDM_MUTE1_Bits
{
    Ifx_UReg_32Bit START1:13;         /**< \brief [12:0] Start Address 1 - START1 (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit END1:13;           /**< \brief [28:16] End Address1 - END1 (rw) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_HSPDM_MUTE1_Bits;

/** \brief OCDS Control and Status Register */
typedef struct _Ifx_HSPDM_OCS_Bits
{
    Ifx_UReg_32Bit reserved_0:24;     /**< \brief [23:0] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_HSPDM_OCS_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_hspdm_Registers_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_ACCEN0_Bits B;          /**< \brief Bitfield access */
} Ifx_HSPDM_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_ACCEN1_Bits B;          /**< \brief Bitfield access */
} Ifx_HSPDM_ACCEN1;

/** \brief ADC Trigger Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_ADCTG_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_ADCTG;

/** \brief ADC Trigger Count Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_ADCTGCNT_Bits B;        /**< \brief Bitfield access */
} Ifx_HSPDM_ADCTGCNT;

/** \brief RAM Buffer A Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_BUFA0_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_BUFA0;

/** \brief RAM Buffer B Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_BUFB0_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_BUFB0;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_CLC_Bits B;             /**< \brief Bitfield access */
} Ifx_HSPDM_CLC;

/** \brief Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_CON_Bits B;             /**< \brief Bitfield access */
} Ifx_HSPDM_CON;

/** \brief Current Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_CURRAD_Bits B;          /**< \brief Bitfield access */
} Ifx_HSPDM_CURRAD;

/** \brief Flags Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_FLAGS_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_FLAGS;

/** \brief Flags Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_FLAGSCLEAR_Bits B;      /**< \brief Bitfield access */
} Ifx_HSPDM_FLAGSCLEAR;

/** \brief Flags Enable Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_FLAGSEN_Bits B;         /**< \brief Bitfield access */
} Ifx_HSPDM_FLAGSEN;

